Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦенаПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаданияЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаданияЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаданияЦеныПоДаннымИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаданияЦенПоДаннымИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройкаНаценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРеализацииНаКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасширенныеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Округление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыЗаданияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>СпособыЗаданияЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнятьПоДаннымИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитыватьПоФормуламОтДругихВидовЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнятьПоДаннымИБПриПоступлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаценкаНаДругойВидЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаценкаНаЦенуПоступления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыЦен/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЦенаПоставщика Тогда
		РеквизитБазовыйВидЦены = ПроверяемыеРеквизиты.Найти("БазовыйВидЦены");
		ПроверяемыеРеквизиты.Удалить(РеквизитБазовыйВидЦены);
		РеквизитНаценка = ПроверяемыеРеквизиты.Найти("Наценка");
		ПроверяемыеРеквизиты.Удалить(РеквизитНаценка);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("ВидЗаданияЦеныПоДаннымИБ");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	ИначеЕсли СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаДругойВидЦен Или СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуПоступления Тогда
		РеквизитВид = ПроверяемыеРеквизиты.Найти("ВидЗаданияЦеныПоДаннымИБ");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("Поставщик");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	ИначеЕсли СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБ Тогда
		РеквизитБазовыйВидЦены = ПроверяемыеРеквизиты.Найти("БазовыйВидЦены");
		ПроверяемыеРеквизиты.Удалить(РеквизитБазовыйВидЦены);
		РеквизитНаценка = ПроверяемыеРеквизиты.Найти("Наценка");
		ПроверяемыеРеквизиты.Удалить(РеквизитНаценка);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("Поставщик");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	ИначеЕсли СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную Тогда	
		РеквизитБазовыйВидЦены = ПроверяемыеРеквизиты.Найти("БазовыйВидЦены");
		ПроверяемыеРеквизиты.Удалить(РеквизитБазовыйВидЦены);
		РеквизитНаценка = ПроверяемыеРеквизиты.Найти("Наценка");
		ПроверяемыеРеквизиты.Удалить(РеквизитНаценка);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("ВидЗаданияЦеныПоДаннымИБ");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("Поставщик");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	КонецЕсли;	
		
КонецПроцедуры
